# Напишіть програму, яка впорядковує три числа від більшого до меншого.
# Програма має вивести три числа, кожне на окремому рядку, упорядкованих від більшого до меншого.


n1 = int(input("Введіть n1:: "))
n2 = int(input("Введіть n2:: "))
n3 = int(input("Введіть n3:: "))

if n1 >= n2 >= n3:
    print(f'{n1}\n{n2}\n{n3}')

elif n1 >= n3 >= n2:
    print(f'{n1}\n{n3}\n{n2}')

elif n2 >= n1 >= n3:
    print(f'{n2}\n{n1}\n{n3}')

elif n2 >= n3 >= n1:
    print(f'{n2}\n{n3}\n{n1}')

elif n3 >= n1 >= n2:
    print(f'{n3}\n{n1}\n{n2}')

elif n3 >= n2 >= n1:
    print(f'{n3}\n{n2}\n{n1}')
